{
  "backend/main.mo": "Main canister logic defining data types, maps, auth mixins, and credential validation with default admin seeding plus storage and Kaizen/Observation management structures.",
  "backend/migration.mo": "Migration module that ensures admin credentials exist by seeding a default admin when upgrading from actors with empty credential maps.",
  "feature_evidence.json": "Feature evidence report describing a frontend change to prefill admin credentials and listing affected files and components.",
  "frontend-file-summaries.txt": "Precomputed summaries of many frontend files including pages, hooks, components, and utilities for build planning.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML file that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Defines all application routes with auth and role guards wrapping pages for dashboard, admin, manager, observations, and kaizen features.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth wrapper enforcing login, admin setup flow, and maintenance‑mode restrictions before rendering children.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based access guard that restricts admin and manager pages and shows an access‑denied alert when unauthorized.",
  "frontend/src/components/empty/EmptyState.tsx": "Reusable empty‑state component with optional image and action button.",
  "frontend/src/components/kaizen/KaizenAssignmentPanel.tsx": "UI panel for assigning a department and required tools to a Kaizen item with validation and mutation hook.",
  "frontend/src/components/kaizen/KaizenDecisionPanel.tsx": "Provides approve/reject actions for a Kaizen entry with comment validation and mutation hooks.",
  "frontend/src/components/kaizen/KaizenPhotoGallery.tsx": "Displays uploaded Kaizen implementation photos with timestamps and loading/empty states.",
  "frontend/src/components/kaizen/KaizenPhotoUploader.tsx": "Handles image selection, validation, upload progress, and photo upload for a Kaizen item.",
  "frontend/src/components/kaizen/KaizenStatusBadge.tsx": "Renders a status badge for a Kaizen item based on predefined status-to-style mappings.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar showing user info, role-based links, and logout handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Simple layout wrapper providing container spacing for app pages.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for initial user profile setup, capturing name and displaying assigned role.",
  "frontend/src/hooks/useActivityHeartbeat.ts": "Sends periodic activity pings to the backend when the user is active and authenticated.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the caller's user profile, role, and admin status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating observations, kaizens, user roles, and credential operations via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes, including color and layout tokens.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminSetupPage.tsx": "Shows confirmation of admin initialization and auto‑redirects to the dashboard.",
  "frontend/src/pages/admin/CredentialManagementPage.tsx": "Implements admin‑only credential management including authorization, creation, reset, enable, and disable actions.",
  "frontend/src/pages/admin/MaintenanceModePage.tsx": "UI page that fetches, displays, and toggles system maintenance mode using a switch and alerts.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Form for assigning user roles by Principal ID with validation, success, and error handling.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard showing observation and kaizen stats, with role‑based alerts and shortcuts.",
  "frontend/src/pages/kaizen/KaizenDetailPage.tsx": "Displays detailed Kaizen info with admin-only decision and assignment panels and optional photo handling.",
  "frontend/src/pages/kaizen/KaizenFormPage.tsx": "Form for submitting a new Kaizen suggestion with validation and backend submission.",
  "frontend/src/pages/kaizen/KaizenListPage.tsx": "Lists Kaizens with filtering, searching, admin visibility rules, and navigation to creation.",
  "frontend/src/pages/kaizen/KaizenNewPage.tsx": "Form page for submitting a new Kaizen, handling validation, mutation, and navigation on success.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login form that validates credentials and routes users based on selected role.",
  "frontend/src/pages/MaintenancePage.tsx": "Displays a maintenance notification page with a sign‑out option clearing identity and cached queries.",
  "frontend/src/pages/manager/AnalyticsPage.tsx": "Displays analytics for observations and kaizens, including charts, counts, and calculated metrics.",
  "frontend/src/pages/manager/GapsPage.tsx": "Analyzes and lists low-activity areas and departments based on recent submission data.",
  "frontend/src/pages/manager/InactivityDashboardPage.tsx": "Shows inactive operators based on a configurable day threshold and supports CSV export.",
  "frontend/src/pages/manager/OperatorActivityPage.tsx": "Displays operator activity with sorting, inactivity calculation, and activity statistics.",
  "frontend/src/pages/observations/ObservationDetailPage.tsx": "Detail view for a single observation showing metadata, description, and navigation controls.",
  "frontend/src/pages/observations/ObservationFormPage.tsx": "Page with a form to submit a new observation including type, title, description, and area, using mutation and navigation on success.",
  "frontend/src/pages/observations/ObservationNewPage.tsx": "Alternate observation submission page with a simplified type list and similar form handling and submission flow.",
  "frontend/src/pages/observations/ObservationsListPage.tsx": "Displays all observations with filtering, search, and role-based visibility, and provides navigation to create a new entry.",
  "frontend/src/utils/analytics.ts": "Utility functions to compute submission trends, top areas, approval rates, decision times, and low-activity segments.",
  "frontend/src/utils/credentialSession.ts": "Manages credential-based session storage, role tracking, and access-denial flags using sessionStorage.",
  "frontend/src/utils/csv.ts": "Generates and downloads CSV files from an array of objects by constructing a blob and trigger link.",
  "frontend/src/utils/loginSelection.ts": "Maps backend credential errors to cleaner user-friendly messages with logic for common error patterns.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support and hash-routes handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, including schema version, authentication change requests, architectural notes, known issues, and existing feature records."
}