{
  "backend/main.mo": "Defines the backend actor with authorization, blob storage, user profiles, observations, kaizens, photos, operator activity, maintenance mode, and admin bootstrap logic.",
  "feature_evidence.json": "Lists feature evidence records mapping features to files, components, tests, and confidence levels for traceability.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files detailing their purpose and role in the application.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "Basic HTML bootstrap file that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures the application's routing, authentication guards, layout, and page components using TanStack Router.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard enforcing login, maintenance mode restrictions, and admin bootstrap conditions.",
  "frontend/src/components/auth/RequireRole.tsx": "Enforces role-based access (admin only) and displays an access-denied message when permissions are insufficient.",
  "frontend/src/components/empty/EmptyState.tsx": "Reusable empty-state component showing optional image, text, and action button.",
  "frontend/src/components/kaizen/KaizenAssignmentPanel.tsx": "Panel allowing managers to assign a department and required tools to a Kaizen item with validation and mutation API calls.",
  "frontend/src/components/kaizen/KaizenDecisionPanel.tsx": "Provides approve/reject UI for a Kaizen item with comment input and mutation handling.",
  "frontend/src/components/kaizen/KaizenPhotoGallery.tsx": "Displays a grid of implementation photos for a Kaizen, with loading and empty states.",
  "frontend/src/components/kaizen/KaizenPhotoUploader.tsx": "Allows users to upload image files for a Kaizen with validation and progress tracking.",
  "frontend/src/components/kaizen/KaizenStatusBadge.tsx": "Renders a status badge for a Kaizen item based on predefined variants.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation, user menu, admin links, and mobile menu handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Simple layout wrapper applying container styling around children.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for initial user profile creation with name and fixed role.",
  "frontend/src/hooks/useActivityHeartbeat.ts": "Sends periodic activity pings when the user is logged in and the page is visible.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the app’s backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the caller’s user profile and checking admin status via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login/logout handling using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating observations, kaizens, and related admin actions using an authenticated actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers, then renders the root component.",
  "frontend/src/pages/admin/AdminSetupPage.tsx": "Provides a one-time admin initialization flow allowing the first user to bootstrap admin access and proceed to manager tools.",
  "frontend/src/pages/admin/MaintenanceModePage.tsx": "Displays and toggles system maintenance mode using API hooks, showing loading and status alerts. Handles optimistic UI updates with local state and toast notifications.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Allows admins to look up users by principal ID and assign roles, showing onboarding instructions and role assignment results. Uses API hooks for lookup and role mutation.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard showing observation and kaizen stats, access-denied alerts, and recent activity.",
  "frontend/src/pages/kaizen/KaizenDetailPage.tsx": "Shows detailed information for a single Kaizen entry with admin-only decision and assignment controls. Includes photo upload, status display, and navigation.",
  "frontend/src/pages/kaizen/KaizenListPage.tsx": "Lists Kaizen suggestions with filtering, searching, and role-based visibility for operators and admins. Provides navigation to create new entries and view details.",
  "frontend/src/pages/kaizen/KaizenNewPage.tsx": "Form for submitting a new Kaizen suggestion with validation and API submission. On success, shows a toast and redirects to the Kaizen list.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login with role-based intents and redirects, showing different options for operator, manager, and admin.",
  "frontend/src/pages/MaintenancePage.tsx": "Displays a maintenance-mode notice with sign‑out functionality while the app is unavailable.",
  "frontend/src/pages/manager/AnalyticsPage.tsx": "Displays analytics for observations and kaizens, including totals, trends, top areas, approval rate, and average decision time.",
  "frontend/src/pages/manager/GapsPage.tsx": "Identifies low-activity areas and departments using submission data and shows them in tables with alerts.",
  "frontend/src/pages/manager/InactivityDashboardPage.tsx": "Shows operators inactive for a configurable number of days and allows exporting results to CSV.",
  "frontend/src/pages/manager/OperatorActivityPage.tsx": "Displays all operator activity with sorting, inactivity calculation, and activity summaries.",
  "frontend/src/pages/observations/ObservationDetailPage.tsx": "Shows full details of a single observation including metadata, timestamps, type, and status.",
  "frontend/src/pages/observations/ObservationNewPage.tsx": "Provides a form to submit a new observation including type, title, description, and optional area.",
  "frontend/src/pages/observations/ObservationsListPage.tsx": "Displays a filterable and searchable list of observations, limiting visibility based on user role and allowing navigation to create new observations.",
  "frontend/src/utils/analytics.ts": "Provides analytics utilities for submissions, including time-series counts, area rankings, approval rates, decision-time averages, and low-activity detection.",
  "frontend/src/utils/csv.ts": "Generates and triggers download of a CSV file from an array of records.",
  "frontend/src/utils/loginSelection.ts": "Manages login intent and access-denied flags using sessionStorage for operator, manager, and admin flows.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters, supporting both query and hash-based routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Documents current project state, requirements, issues, and architectural notes for ongoing feature development and login workflow changes."
}