{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, observations, kaizens, photos, and activity tracking with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting a UI change for repositioning the CSV export button on the manager inactivity dashboard.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference in build or review workflows.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines router, authentication guards, layout, and routes for all major app pages.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth wrapper that blocks unauthenticated users and shows a loading state during identity initialization.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based access guard that restricts admin‑only pages and shows an access‑denied alert when unauthorized.",
  "frontend/src/components/empty/EmptyState.tsx": "Reusable empty‑state component with optional image and action button.",
  "frontend/src/components/kaizen/KaizenAssignmentPanel.tsx": "Manager panel for assigning a kaizen to a department and specifying required tools.",
  "frontend/src/components/kaizen/KaizenDecisionPanel.tsx": "Manager panel for approving or rejecting a kaizen with required comments.",
  "frontend/src/components/kaizen/KaizenPhotoGallery.tsx": "Displays implementation photos for a kaizen with loading, empty, and gallery states.",
  "frontend/src/components/kaizen/KaizenPhotoUploader.tsx": "Image uploader for Kaizen entries with validation and upload progress using ExternalBlob and mutateAsync.",
  "frontend/src/components/kaizen/KaizenStatusBadge.tsx": "Renders a status badge for a Kaizen based on predefined label and variant mappings.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation, user menu, admin links, and mobile drawer controlled by identity and role checks.",
  "frontend/src/components/layout/AppLayout.tsx": "Simple container layout wrapper providing consistent page padding and max width.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Profile setup dialog allowing a user to submit their name and default role via a profile creation mutation.",
  "frontend/src/hooks/useActivityHeartbeat.ts": "Sends periodic activity pings to the backend when identity is active and the page is visible.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Queries the caller's user profile and admin status using the current actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via React context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend operations for observations, kaizens, photos, activities, and user profile updates.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying base colors and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, rendering the main App component.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Allows admins to look up users by principal and assign roles, showing profile details when available.",
  "frontend/src/pages/DashboardPage.tsx": "Displays key metrics, recent kaizens, and quick action buttons using fetched observations and kaizen data.",
  "frontend/src/pages/kaizen/KaizenDetailPage.tsx": "Shows full details for a specific kaizen with admin actions, assignment options, and photo management.",
  "frontend/src/pages/kaizen/KaizenListPage.tsx": "Lists kaizen entries with search and status filters, adjusting visibility based on user role.",
  "frontend/src/pages/kaizen/KaizenNewPage.tsx": "Form page for submitting a new Kaizen, handling validation, mutation, and navigation on success.",
  "frontend/src/pages/LoginPage.tsx": "Provides role-based login via Internet Identity and redirects users based on stored login intent.",
  "frontend/src/pages/manager/AnalyticsPage.tsx": "Dashboard that aggregates observations and kaizens to display metrics, charts, and summary statistics.",
  "frontend/src/pages/manager/GapsPage.tsx": "Displays low-activity areas and departments using gap-analysis utilities to highlight underreported segments.",
  "frontend/src/pages/manager/InactivityDashboardPage.tsx": "Shows operators inactive for a configurable number of days and provides CSV export of inactivity data.",
  "frontend/src/pages/manager/OperatorActivityPage.tsx": "Lists all operator activity with sorting, inactivity calculations, and thresholds for identifying inactive users.",
  "frontend/src/pages/observations/ObservationDetailPage.tsx": "Detail view displaying full information for a specific observation, including metadata and navigation controls.",
  "frontend/src/pages/observations/ObservationNewPage.tsx": "A form page for creating and submitting new safety or quality observations with validation and navigation.",
  "frontend/src/pages/observations/ObservationsListPage.tsx": "Displays a filterable and searchable list of observations, restricting visibility for non-admin users.",
  "frontend/src/utils/analytics.ts": "Provides analytics utilities for counting submissions, identifying top areas, and calculating kaizen metrics.",
  "frontend/src/utils/csv.ts": "Generates and triggers download of CSV files from data arrays.",
  "frontend/src/utils/loginSelection.ts": "Stores, retrieves, and clears login intent in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Stores the project's versioned state, known issues, and a list of implemented features for role‑based access, operator submissions, and manager workflows. Serves as a central record of requirements, statuses, and architectural context."
}