{
  "backend/main.mo": "Motoko canister implementing user profiles, observations, kaizens, photos, and access control with storage mixins.",
  "feature_evidence.json": "Feature evidence report linking new operator-activity manager page and routing updates to affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files including new manager operator activity page and routing changes.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main router and layout setup defining authenticated routes, manager pages, and global providers.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard redirecting unauthenticated users to login and showing a loading state.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-based access guard allowing only admins to access certain routes and showing denial UI otherwise.",
  "frontend/src/components/empty/EmptyState.tsx": "Reusable empty-state component with optional image and action button.",
  "frontend/src/components/kaizen/KaizenAssignmentPanel.tsx": "UI panel allowing managers to assign a department and required tools to a Kaizen.",
  "frontend/src/components/kaizen/KaizenDecisionPanel.tsx": "Panel for approving or rejecting a Kaizen with required manager comments.",
  "frontend/src/components/kaizen/KaizenPhotoGallery.tsx": "Displays implementation photos for a Kaizen, including loading and empty states.",
  "frontend/src/components/kaizen/KaizenPhotoUploader.tsx": "Image uploader for Kaizen items with validation, progress tracking, and upload mutation.",
  "frontend/src/components/kaizen/KaizenStatusBadge.tsx": "Displays a status badge for a Kaizen using predefined labels and variants.",
  "frontend/src/components/layout/AppHeader.tsx": "Main app header with navigation, user menu, admin links, and mobile menu support.",
  "frontend/src/components/layout/AppLayout.tsx": "Simple layout wrapper that centers and constrains page content.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new users to enter name and create their profile via mutation.",
  "frontend/src/hooks/useActivityHeartbeat.ts": "Hook that periodically pings backend activity when user is active and identity is present.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries on changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the current user profile and checking admin status via actor calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook managing Internet Identity auth state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and mutations for observations, kaizens, photos, and user actions.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and renders App.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Allows admins to look up users by principal and assign roles.",
  "frontend/src/pages/DashboardPage.tsx": "Renders dashboard with stats, recent kaizens, and quick navigation actions.",
  "frontend/src/pages/kaizen/KaizenDetailPage.tsx": "Displays detailed view of a Kaizen with admin actions and photo management.",
  "frontend/src/pages/kaizen/KaizenListPage.tsx": "Shows searchable and filterable list of Kaizen suggestions with role-based visibility.",
  "frontend/src/pages/kaizen/KaizenNewPage.tsx": "Form page for submitting a new Kaizen entry, handling validation, submission, and navigation.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity login UI and redirects authenticated users to home.",
  "frontend/src/pages/manager/AnalyticsPage.tsx": "Manager dashboard computing and displaying analytics for observations and Kaizens using various metrics.",
  "frontend/src/pages/manager/GapsPage.tsx": "Displays low-activity areas and departments based on recent submissions to identify engagement gaps.",
  "frontend/src/pages/manager/InactivityDashboardPage.tsx": "Shows inactive operators based on a configurable inactivity threshold and supports CSV export.",
  "frontend/src/pages/manager/OperatorActivityPage.tsx": "Lists operator activity with sortable metrics and inactivity calculations to monitor overall engagement.",
  "frontend/src/pages/observations/ObservationDetailPage.tsx": "Detail view for a single observation showing metadata, description, and navigation controls.",
  "frontend/src/pages/observations/ObservationNewPage.tsx": "Renders a form for creating a new observation with type, title, description, and optional area, and submits via a mutation hook.",
  "frontend/src/pages/observations/ObservationsListPage.tsx": "Displays a filterable and searchable list of observations, limiting visibility based on user role and allowing navigation to create new entries.",
  "frontend/src/utils/analytics.ts": "Provides analytics helpers for counting submissions, top areas, approval rates, decision times, and low-activity segments.",
  "frontend/src/utils/csv.ts": "Generates and downloads a CSV file from an array of data objects.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL or session-based parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins.",
  "project_state.json": "Metadata describing project state, features, requirements, and versioning information."
}