{
  "backend/main.mo": "Canister actor defining roles, credential validation, Kaizen and Observation types, storage maps, and maintenance/auth logic with mixins.",
  "feature_evidence.json": "Feature evidence report linking logout‑button requirement to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering routing, auth, UI components, and dashboard features.",
  "frontend/index.css": "Empty stylesheet placeholder for root-level CSS.",
  "frontend/index.html": "Basic HTML shell loading the React frontend via main.tsx.",
  "frontend/src/App.tsx": "Defines full TanStack Router configuration with auth and role guards for all app pages.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth wrapper enforcing login, admin setup, and maintenance-mode logic before rendering children.",
  "frontend/src/components/auth/RequireRole.tsx": "Role guard that restricts access to admin or manager pages and shows an access‑denied UI when unauthorized.",
  "frontend/src/components/empty/EmptyState.tsx": "Reusable empty‑state component displaying message, optional image, and action button.",
  "frontend/src/components/kaizen/KaizenAssignmentPanel.tsx": "Manager UI for assigning a Kaizen to a department and required tools with validation and mutation calls.",
  "frontend/src/components/kaizen/KaizenDecisionPanel.tsx": "Provides approve/reject actions for a Kaizen item with required comments and mutation handling.",
  "frontend/src/components/kaizen/KaizenPhotoGallery.tsx": "Displays uploaded Kaizen photos with loading, empty states, and timestamp formatting.",
  "frontend/src/components/kaizen/KaizenPhotoUploader.tsx": "Handles image file selection, validation, upload with progress tracking, and success/error toasts.",
  "frontend/src/components/kaizen/KaizenStatusBadge.tsx": "Renders a status badge based on KaizenStatus with preset labels and variants.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar showing user info, role-based menus, and logout handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Simple container wrapper providing page layout spacing.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for new users to submit name and create a profile with fixed role.",
  "frontend/src/hooks/useActivityHeartbeat.ts": "Sends periodic activity pings when user is active and authenticated.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useAppLogout.ts": "Centralized logout clearing session, cache, and redirecting to login.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching caller’s profile, admin status, and role via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and exposing login state and actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as observations, kaizens, and user-related actions.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminSetupPage.tsx": "Shows admin setup confirmation and auto-redirects to the dashboard after initialization.",
  "frontend/src/pages/admin/CredentialManagementPage.tsx": "Admin interface for authorizing, creating, resetting, enabling, and disabling user credentials with dialogs and validation.",
  "frontend/src/pages/admin/MaintenanceModePage.tsx": "Provides UI to view and toggle system maintenance mode with optimistic updates and status alerts.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Form for assigning user roles by Principal ID with validation and success/error feedback.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with stats, recent kaizens, and access-denied alerts based on user role.",
  "frontend/src/pages/kaizen/KaizenDetailPage.tsx": "Displays detailed Kaizen info and conditionally shows admin panels for decisions, assignments, and photo uploads.",
  "frontend/src/pages/kaizen/KaizenFormPage.tsx": "Form for submitting a new Kaizen idea with required field validation and submission handling.",
  "frontend/src/pages/kaizen/KaizenListPage.tsx": "Displays and filters Kaizen submissions with search, status filters, and role-based visibility.",
  "frontend/src/pages/kaizen/KaizenNewPage.tsx": "Provides a form for creating a new Kaizen submission and handles validation and submission.",
  "frontend/src/pages/LoginPage.tsx": "Implements credential-based login with role selection, validation, and navigation on success.",
  "frontend/src/pages/MaintenancePage.tsx": "Displays a maintenance notice and provides a sign-out action clearing identity and cache.",
  "frontend/src/pages/manager/AnalyticsPage.tsx": "Shows analytics for observations and Kaizens, including totals, approval rates, trends, and top areas.",
  "frontend/src/pages/manager/GapsPage.tsx": "Identifies and displays low-activity areas and departments based on recent submissions.",
  "frontend/src/pages/manager/InactivityDashboardPage.tsx": "Displays operators inactive for a configurable number of days and allows CSV export of results.",
  "frontend/src/pages/manager/ManagerProfilePage.tsx": "Shows manager profile details, including name, role, login ID, and provides logout and navigation options.",
  "frontend/src/pages/manager/OperatorActivityPage.tsx": "Displays operator activity with sorting, inactivity calculations, and threshold-based active/inactive counts.",
  "frontend/src/pages/observations/ObservationDetailPage.tsx": "Shows detailed information for a single observation with metadata and navigation controls.",
  "frontend/src/pages/observations/ObservationFormPage.tsx": "Provides a form to submit a new observation with validation and mutation handling.",
  "frontend/src/pages/observations/ObservationNewPage.tsx": "Simplified observation submission page with predefined types and form validation.",
  "frontend/src/pages/observations/ObservationsListPage.tsx": "Lists observations with filtering, search, admin-aware visibility, and navigation to creation.",
  "frontend/src/pages/operator/OperatorProfilePage.tsx": "Displays the logged-in operator's profile, role, and logout/back actions.",
  "frontend/src/utils/analytics.ts": "Provides analytics helpers for submissions, top areas, approval rates, decision time, and low-activity segments.",
  "frontend/src/utils/credentialInput.ts": "Normalizes and validates credential input fields and checks login/password pair validity.",
  "frontend/src/utils/credentialSession.ts": "Manages credential-based auth session storage, roles, and access-denied flags.",
  "frontend/src/utils/csv.ts": "Generates and triggers download of CSV files from data arrays.",
  "frontend/src/utils/goBackOrDashboard.ts": "Hook that navigates back if possible or redirects to the dashboard.",
  "frontend/src/utils/loginSelection.ts": "Maps backend credential validation errors to safe, user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URL and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Tracks project state, requirements, issues, and notes regarding the authentication redesign and admin credential system."
}