{
  "kind": "build_request",
  "title": "Add “Sign in as Admin” Internet Identity entry point and clarify that password-based accounts are not supported",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Update the Login page to add a third Internet Identity entry point labeled “Sign in as Admin” alongside the existing “Sign in as Operator” and “Sign in as Manager” options.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "See in the log in page add a sign in as admin and the password should be pass and user name should be admin ..."
        ]
      },
      "acceptanceCriteria": [
        "/login shows three buttons: “Sign in as Operator”, “Sign in as Manager”, and “Sign in as Admin”.",
        "Clicking “Sign in as Admin” initiates the same Internet Identity login flow as the other buttons (no username/password fields are added).",
        "All user-facing text on the Login page remains in English."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Extend the session-stored login intent logic to support an “admin” intent and implement post-login redirect behavior for the new admin intent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "By log into this admin page I can create user id and password for both the manager and operator so that they can log in by the password I have given to them by configuring in the admin page"
        ]
      },
      "acceptanceCriteria": [
        "Login intent storage supports the values: operator, manager, admin.",
        "After successful Internet Identity login: if intent is admin and the caller is an Admin/Manager, redirect to an admin landing page (use an existing admin route such as /admin/roles).",
        "After successful Internet Identity login: if intent is admin and the caller is not an Admin/Manager, show a clear English message explaining that Admin access must be assigned by an existing Admin, then redirect to the operator dashboard (/).",
        "The intent value is cleared after redirect (success or handled denial), consistent with existing operator/manager behavior."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Add clear English guidance in the admin area that user access is managed by assigning roles to Internet Identity principals (not by creating usernames/passwords), and explain the onboarding steps for Operators and Managers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I can create user id and password for both the manager and operator so that they can log in by the password I have given to them by configuring in the admin page"
        ]
      },
      "acceptanceCriteria": [
        "An existing admin page (e.g., Role Management) includes a short English section explaining: (1) users sign in with Internet Identity, (2) they share their Principal ID with the Admin, (3) the Admin assigns Operator (User) or Manager/Admin roles.",
        "The guidance does not mention or imply creating/storing passwords.",
        "The guidance is visible only to Admin/Manager users (i.e., on an admin-protected route)."
      ]
    }
  ],
  "constraints": [
    "Do not implement username/password authentication or any UI that accepts/stores passwords for Operators/Managers/Admins.",
    "Authentication must remain exclusively via Internet Identity (AuthClient).",
    "Do not modify files under frontend/src/components/ui or any other immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Creating, storing, or managing password-based accounts for Operators or Managers.",
    "Adding an external database or third-party authentication provider.",
    "Changing the existing role model beyond using the current Admin/Manager vs Operator (User) permissions already implemented."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}