{
  "kind": "build_request",
  "title": "Reposition CSV export button on the manager Inactivity Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Move the \"Download CSV\" export button on the manager Inactivity Dashboard to a more prominent location: place it in the page header row next to the \"Inactivity Dashboard\" title/description area, aligned to the right, instead of inside the \"Inactive Operators\" card header. The button must remain visible only when there is at least one inactive operator to export, and it must continue to export the same CSV content and filename format currently used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "On the Inactivity Dashboard page, when there are 1+ inactive operators, a \"Download CSV\" button appears in the page header area (near the page title) aligned right.",
        "The \"Inactive Operators\" card header no longer contains the \"Download CSV\" button.",
        "When there are 0 inactive operators, the \"Download CSV\" button is not shown anywhere on the page.",
        "Clicking \"Download CSV\" downloads a CSV with the same columns and filename format as before (Principal, Last Activity, Days Inactive; filename includes the days threshold and current date).",
        "No changes are made to backend APIs or CSV generation logic beyond the UI relocation."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI components).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new export formats (e.g., PDF, Excel).",
    "Changing the CSV schema/columns or filename conventions beyond what is needed to relocate the button.",
    "Adding notifications, toasts, or new manager workflows unrelated to repositioning the export button."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}