{
  "kind": "build_request",
  "title": "Set Admin Authorization default credentials to admin / 1234",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-65",
      "text": "Update the Admin Authorization form to prefill the Admin Login ID as \"admin\" and the Password as \"1234\" when the page first loads, while still allowing the user to edit both fields before submitting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "In admin authorisation page set the admin user id as admin and password as 1234"
        ]
      },
      "acceptanceCriteria": [
        "When visiting the Admin Credentials Management page and the \"Admin Authorization Required\" form is shown, the \"Admin Login ID\" input is pre-populated with \"admin\".",
        "When visiting the Admin Credentials Management page and the \"Admin Authorization Required\" form is shown, the \"Password\" input is pre-populated with \"1234\" (masked as a password field).",
        "The user can overwrite either prefilled value and submit the form normally.",
        "All user-facing text remains in English."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Change the backend’s default seeded Admin credential password to \"1234\" (Login ID remains \"admin\"), so that a fresh installation can authorize admin actions using admin/1234.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "In admin authorisation page set the admin user id as admin and password as 1234"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh install (credential store empty), the system seeds a default Admin credential with Login ID \"admin\" and password \"1234\" (only when the credential store is empty).",
        "Admin authorization succeeds when using Login ID \"admin\" and password \"1234\".",
        "No migration is introduced unless it is strictly required to preserve existing canister state."
      ]
    },
    {
      "id": "REQ-67",
      "text": "Ensure the backend Admin Authorization endpoint can successfully authorize on a fresh install even if it is called before any other credential-validation endpoint, by applying the same default-admin seeding behavior when the credential store is empty.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "In admin authorisation page set the admin user id as admin and password as 1234"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh install, calling the admin authorization API first (before any login validation call) still succeeds with admin/1234.",
        "If credentials already exist, the backend does not overwrite or reset existing credentials during admin authorization."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; keep all Motoko logic in backend/main.mo.",
    "Do not edit any frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not implement or change Internet Identity authentication behavior.",
    "Do not redesign the Admin Authorization UI beyond prefilling the requested default values.",
    "Do not change role/permission rules or add new roles."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}